cases/laminarTransient/0.org/Efield
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

// Field Dictionary

FoamFile
{
    version         2.0;
    format          ascii;
    class           volVectorField;
    object          Efield;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [1 1 -3 0 0 -1 0]; // [kg * m /( s^3 A)]

internalField   uniform ( 0 0 0 );

boundaryField
{
    exposed        
    {    
        type            zeroGradient; 
    }
    
    solidWall      
    {   
        type            zeroGradient; 
    }
    
    wallRhoC      
    {   
        type            zeroGradient; 
    }

    front     
    {
        type            empty; 
    }
   
    back 
    {
        type            empty;      
    }

    top
    {
        type            zeroGradient; 
    }
    
    bottom
    {
        type            zeroGradient; 
    }
    
    inlet
    {
        type            zeroGradient; 
    }
    
    outlet
    {
        type            zeroGradient; 
    }

}


// ************************************************************************* //
